In [1]:
# https://github.com/mrdbourke/zero-to-mastery-ml/blob/master/section-2-data-science-and-ml-tools/pandas-exercises.ipynb
import pandas as pd

In [2]:
colors = pd.Series(["Red", "Yellow", "Blue"])

In [3]:
colors

0       Red
1    Yellow
2      Blue
dtype: object

In [4]:
cars = pd.Series(["Vw", "Honda", "Toyota"])
cars

0        Vw
1     Honda
2    Toyota
dtype: object

In [6]:
df = pd.DataFrame({
    "Cars": cars,
    "Colors": colors
})

In [7]:
df

     Cars  Colors
0      Vw     Red
1   Honda  Yellow
2  Toyota    Blue

In [8]:
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [9]:
df.to_csv("My-car-csv.csv")

In [10]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [11]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [13]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
fuel_economy = [7.5, 5.6, 4.7, 9.0, 8.5, 9.5, 7.7, 3.0, 5.5, 4.0]
car_sales["Fuel economy"] = fuel_economy

In [15]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Fuel economy
0  Toyota  White         150043      4   $4,000.00           7.5
1   Honda    Red          87899      4   $5,000.00           5.6
2  Toyota   Blue          32549      3   $7,000.00           4.7
3     BMW  Black          11179      5  $22,000.00           9.0
4  Nissan  White         213095      4   $3,500.00           8.5
5  Toyota  Green          99213      4   $4,500.00           9.5
6   Honda   Blue          45698      4   $7,500.00           7.7
7   Honda   Blue          54738      4   $7,000.00           3.0
8  Toyota  White          60000      4   $6,250.00           5.5
9  Nissan  White          31600      4   $9,700.00           4.0

In [16]:
car_sales["Fuel economy"].mean()

6.5

In [17]:
car_sales["Fuel economy"].sum()

65.0

In [18]:
list(car_sales)

['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price', 'Fuel economy']

In [19]:
len(car_sales)

10

In [22]:
car_sales.loc[:4]car

     Make Colour  Odometer (KM)  Doors       Price  Fuel economy
0  Toyota  White         150043      4   $4,000.00           7.5
1   Honda    Red          87899      4   $5,000.00           5.6
2  Toyota   Blue          32549      3   $7,000.00           4.7
3     BMW  Black          11179      5  $22,000.00           9.0
4  Nissan  White         213095      4   $3,500.00           8.5

In [23]:
car_sales[:6]

     Make Colour  Odometer (KM)  Doors       Price  Fuel economy
0  Toyota  White         150043      4   $4,000.00           7.5
1   Honda    Red          87899      4   $5,000.00           5.6
2  Toyota   Blue          32549      3   $7,000.00           4.7
3     BMW  Black          11179      5  $22,000.00           9.0
4  Nissan  White         213095      4   $3,500.00           8.5
5  Toyota  Green          99213      4   $4,500.00           9.5

In [25]:
car_sales.tail(5)

     Make Colour  Odometer (KM)  Doors      Price  Fuel economy
5  Toyota  Green          99213      4  $4,500.00           9.5
6   Honda   Blue          45698      4  $7,500.00           7.7
7   Honda   Blue          54738      4  $7,000.00           3.0
8  Toyota  White          60000      4  $6,250.00           5.5
9  Nissan  White          31600      4  $9,700.00           4.0

In [26]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Fuel economy            9.0
Name: 3, dtype: object